## Numpy

#### Задание 1

In [34]:
import numpy as np

In [35]:
a = np.array([[1, 6,], 
              [2, 8,], 
              [3, 11,],
              [3, 10,],
              [1, 7,]])

print(a)

print("Размерность a: {}".format(a.ndim))

print("Форма a: {}".format(a.shape))

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
Размерность a: 2
Форма a: (5, 2)

In [36]:
a_mean = a.mean(axis=0)
print("Средние значения столбцов: ", a_mean)

Средние значения столбцов:  [2.  8.4]

#### Задание 2

In [37]:
a_centered = a - a_mean 
print("Средние значения столбцов: \n", a_centered)

Средние значения столбцов:
 [[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

#### Задание 3

In [38]:
a_centered_sp = a_centered[:,0] @ a_centered[:,1]
a_centered_sp

8.0

In [39]:
a_centered_sp_div_nsub1 = a_centered_sp / 4
a_centered_sp_div_nsub1

2.0

#### Задание 4

In [40]:
cov_f = np.cov(a.T)
cov_f[0, 1]

2.0

## Pandas

#### Задание 1

In [41]:
import pandas as pd

In [42]:
authors = pd.DataFrame({
    'author_id':  [1, 2, 3],
    'author_name':['Тургенев', 'Чехов', 'Островский']}, columns=['author_id', 'author_name']
)

books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title','price']
)

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [43]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Задание 2

In [44]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3

In [45]:
authors_price.nlargest(5, "price")

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

#### Задание 4

In [46]:

authors_stat = pd.DataFrame({
    
    'min_price': authors_price.groupby(["author_name"])['price'].min(), 
    'max_price': authors_price.groupby(["author_name"])['price'].max(),
    'mean_price': authors_price.groupby(["author_name"])['price'].mean()}, columns=['min_price', 'max_price', 'mean_price']
)
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000